{
  "architectures": [
    "ASTForAudioClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "dtype": "float32",
  "frequency_stride": 10,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "airplane",
    "1": "breathing",
    "2": "brushing_teeth",
    "3": "can_opening",
    "4": "car_horn",
    "5": "cat",
    "6": "chainsaw",
    "7": "chirping_birds",
    "8": "church_bells",
    "9": "clapping",
    "10": "clock_alarm",
    "11": "clock_tick",
    "12": "coughing",
    "13": "cow",
    "14": "crackling_fire",
    "15": "crickets",
    "16": "crow",
    "17": "crying_baby",
    "18": "dog",
    "19": "door_wood_creaks",
    "20": "door_wood_knock",
    "21": "drinking_sipping",
    "22": "engine",
    "23": "fireworks",
    "24": "footsteps",
    "25": "frog",
    "26": "glass_breaking",
    "27": "hand_saw",
    "28": "helicopter",
    "29": "hen",
    "30": "insects",
    "31": "keyboard_typing",
    "32": "laughing",
    "33": "mouse_click",
    "34": "pig",
    "35": "pouring_water",
    "36": "rain",
    "37": "rooster",
    "38": "sea_waves",
    "39": "sheep",
    "40": "siren",
    "41": "sneezing",
    "42": "snoring",
    "43": "thunderstorm",
    "44": "toilet_flush",
    "45": "train",
    "46": "vacuum_cleaner",
    "47": "washing_machine",
    "48": "water_drops",
    "49": "wind"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "airplane": 0,
    "breathing": 1,
    "brushing_teeth": 2,
    "can_opening": 3,
    "car_horn": 4,
    "cat": 5,
    "chainsaw": 6,
    "chirping_birds": 7,
    "church_bells": 8,
    "clapping": 9,
    "clock_alarm": 10,
    "clock_tick": 11,
    "coughing": 12,
    "cow": 13,
    "crackling_fire": 14,
    "crickets": 15,
    "crow": 16,
    "crying_baby": 17,
    "dog": 18,
    "door_wood_creaks": 19,
    "door_wood_knock": 20,
    "drinking_sipping": 21,
    "engine": 22,
    "fireworks": 23,
    "footsteps": 24,
    "frog": 25,
    "glass_breaking": 26,
    "hand_saw": 27,
    "helicopter": 28,
    "hen": 29,
    "insects": 30,
    "keyboard_typing": 31,
    "laughing": 32,
    "mouse_click": 33,
    "pig": 34,
    "pouring_water": 35,
    "rain": 36,
    "rooster": 37,
    "sea_waves": 38,
    "sheep": 39,
    "siren": 40,
    "sneezing": 41,
    "snoring": 42,
    "thunderstorm": 43,
    "toilet_flush": 44,
    "train": 45,
    "vacuum_cleaner": 46,
    "washing_machine": 47,
    "water_drops": 48,
    "wind": 49
  },
  "layer_norm_eps": 1e-12,
  "max_length": 1024,
  "model_type": "audio-spectrogram-transformer",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "num_mel_bins": 128,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "time_stride": 10,
  "transformers_version": "4.57.1"
}
